voc-vach-iot-ch32v003/ch32v003_led_matrix/ch32v003_led_matrix.c
#include "ch32v003_led_matrix.h"
#include <string.h>

// Bảng Font 5x7 chuẩn ASCII (từ mã 32 ' ' đến 126 '~')
static const uint8_t font5x7[][5] = {
    {0x00, 0x00, 0x00, 0x00, 0x00}, // Space (32)
    {0x00, 0x00, 0x5F, 0x00, 0x00}, // !
    {0x00, 0x07, 0x00, 0x07, 0x00}, // "
    {0x14, 0x7F, 0x14, 0x7F, 0x14}, // #
    {0x24, 0x2A, 0x7F, 0x2A, 0x12}, // $
    {0x23, 0x13, 0x08, 0x64, 0x62}, // %
    {0x36, 0x49, 0x55, 0x22, 0x50}, // &
    {0x00, 0x05, 0x03, 0x00, 0x00}, // '
    {0x00, 0x1C, 0x22, 0x41, 0x00}, // (
    {0x00, 0x41, 0x22, 0x1C, 0x00}, // )
    {0x14, 0x08, 0x3E, 0x08, 0x14}, // *
    {0x08, 0x08, 0x3E, 0x08, 0x08}, // +
    {0x00, 0x50, 0x30, 0x00, 0x00}, // ,
    {0x08, 0x08, 0x08, 0x08, 0x08}, // -
    {0x00, 0x60, 0x60, 0x00, 0x00}, // .
    {0x20, 0x10, 0x08, 0x04, 0x02}, // /
    {0x3E, 0x51, 0x49, 0x45, 0x3E}, // 0
    {0x00, 0x42, 0x7F, 0x40, 0x00}, // 1
    {0x42, 0x61, 0x51, 0x49, 0x46}, // 2
    {0x21, 0x41, 0x45, 0x4B, 0x31}, // 3
    {0x18, 0x14, 0x12, 0x7F, 0x10}, // 4
    {0x27, 0x45, 0x45, 0x45, 0x39}, // 5
    {0x3C, 0x4A, 0x49, 0x49, 0x30}, // 6
    {0x01, 0x71, 0x09, 0x05, 0x03}, // 7
    {0x36, 0x49, 0x49, 0x49, 0x36}, // 8
    {0x06, 0x49, 0x49, 0x29, 0x1E}, // 9
    {0x00, 0x36, 0x36, 0x00, 0x00}, // :
    {0x00, 0x56, 0x36, 0x00, 0x00}, // ;
    {0x08, 0x14, 0x22, 0x41, 0x00}, // <
    {0x14, 0x14, 0x14, 0x14, 0x14}, // =
    {0x00, 0x41, 0x22, 0x14, 0x08}, // >
    {0x02, 0x01, 0x51, 0x09, 0x06}, // ?
    {0x3E, 0x41, 0x5D, 0x55, 0x1E}, // @
    {0x7E, 0x11, 0x11, 0x11, 0x7E}, // A
    {0x7F, 0x49, 0x49, 0x49, 0x36}, // B
    {0x3E, 0x41, 0x41, 0x41, 0x22}, // C
    {0x7F, 0x41, 0x41, 0x22, 0x1C}, // D
    {0x7F, 0x49, 0x49, 0x49, 0x41}, // E
    {0x7F, 0x09, 0x09, 0x09, 0x01}, // F
    {0x3E, 0x41, 0x49, 0x49, 0x7A}, // G
    {0x7F, 0x08, 0x08, 0x08, 0x7F}, // H
    {0x00, 0x41, 0x7F, 0x41, 0x00}, // I
    {0x20, 0x40, 0x41, 0x3F, 0x01}, // J
    {0x7F, 0x08, 0x14, 0x22, 0x41}, // K
    {0x7F, 0x40, 0x40, 0x40, 0x40}, // L
    {0x7F, 0x02, 0x0C, 0x02, 0x7F}, // M
    {0x7F, 0x04, 0x08, 0x10, 0x7F}, // N
    {0x3E, 0x41, 0x41, 0x41, 0x3E}, // O
    {0x7F, 0x09, 0x09, 0x09, 0x06}, // P
    {0x3E, 0x41, 0x51, 0x21, 0x5E}, // Q
    {0x7F, 0x09, 0x19, 0x29, 0x46}, // R
    {0x46, 0x49, 0x49, 0x49, 0x31}, // S
    {0x01, 0x01, 0x7F, 0x01, 0x01}, // T
    {0x3F, 0x40, 0x40, 0x40, 0x3F}, // U
    {0x1F, 0x20, 0x40, 0x20, 0x1F}, // V
    {0x3F, 0x40, 0x38, 0x40, 0x3F}, // W
    {0x63, 0x14, 0x08, 0x14, 0x63}, // X
    {0x07, 0x08, 0x70, 0x08, 0x07}, // Y
    {0x61, 0x51, 0x49, 0x45, 0x43}, // Z
    {0x3C, 0x40, 0x40, 0x40, 0x3C}, // [
    {0x02, 0x04, 0x08, 0x10, 0x20}, // \.
    {0x3E, 0x01, 0x01, 0x01, 0x3E}, // ]
    {0x04, 0x02, 0x01, 0x02, 0x04}, // ^
    {0x40, 0x40, 0x40, 0x40, 0x40}, // _
    {0x00, 0x01, 0x02, 0x05, 0x00}, // `
    {0x20, 0x54, 0x54, 0x54, 0x78}, // a
    {0x7F, 0x48, 0x44, 0x44, 0x38}, // b
    {0x38, 0x44, 0x44, 0x44, 0x20}, // c
    {0x38, 0x44, 0x44, 0x48, 0x7F}, // d
    {0x38, 0x54, 0x54, 0x54, 0x18}, // e
    {0x08, 0x7E, 0x09, 0x01, 0x02}, // f
    {0x0C, 0x52, 0x52, 0x52, 0x3E}, // g
    {0x7F, 0x08, 0x04, 0x04, 0x7F}, // h
    {0x00, 0x44, 0x7D, 0x40, 0x00}, // i
    {0x20, 0x40, 0x44, 0x3D, 0x00}, // j
    {0x7F, 0x10, 0x28, 0x44, 0x00}, // k
    {0x00, 0x41, 0x7F, 0x40, 0x00}, // l
    {0x7C, 0x04, 0x18, 0x04, 0x7C}, // m
    {0x7C, 0x08, 0x04, 0x04, 0x7B}, // n
    {0x38, 0x44, 0x44, 0x44, 0x38}, // o
    {0x7C, 0x14, 0x14, 0x14, 0x08}, // p
    {0x08, 0x14, 0x14, 0x18, 0x7C}, // q
    {0x7C, 0x08, 0x04, 0x04, 0x08}, // r
    {0x48, 0x54, 0x54, 0x54, 0x24}, // s
    {0x04, 0x3F, 0x44, 0x40, 0x20}, // t
    {0x3C, 0x40, 0x40, 0x20, 0x7C}, // u
    {0x1C, 0x20, 0x40, 0x20, 0x1C}, // v
    {0x3C, 0x40, 0x30, 0x40, 0x3C}, // w
    {0x44, 0x28, 0x10, 0x28, 0x44}, // x
    {0x0C, 0x50, 0x50, 0x50, 0x3C}, // y
    {0x44, 0x64, 0x54, 0x4C, 0x44}, // z
    {0x00, 0x08, 0x36, 0x41, 0x00}, // {
    {0x00, 0x00, 0x7F, 0x00, 0x00}, // |
    {0x00, 0x41, 0x36, 0x08, 0x00}, // }
    {0x10, 0x08, 0x18, 0x10, 0x08} // ~
};

void ledMatrixInit(LedMatrix_t* dev, uint8_t* buffer, const uint8_t matrixCount, const MCU_Pin_t csPin)
{
    dev->frameBuffer = buffer;
    dev->matrixCount = matrixCount;
    dev->rotation = MATRIX_ROTATE_0;

    max7219Init(&dev->maxDev, csPin, matrixCount);
    ledMatrixClearBuffer(dev);
    ledMatrixUpdate(dev);
}

void ledMatrixClearBuffer(LedMatrix_t* dev)
{
    memset(dev->frameBuffer, 0, dev->matrixCount * 8);
}

void ledMatrixUpdate(LedMatrix_t* dev)
{
    for (uint8_t row = 0; row < 8; row++)
    {
        for (uint8_t devIdx = 0; devIdx < dev->matrixCount; devIdx++)
        {
            const uint8_t rowData = dev->frameBuffer[devIdx * 8 + row];
            max7219WriteReg(&dev->maxDev, devIdx, MAX7219_REG_DIGIT0 + row, rowData);
        }
    }
}

void ledMatrixSetRotation(LedMatrix_t* dev, const MatrixRotation_t rotation)
{
    dev->rotation = rotation;
}

void ledMatrixSetScrollDirection(LedMatrix_t* dev, const MatrixScrollDirection_t direction)
{
    dev->scrollDirection = direction;
}

void ledMatrixDrawPixel(LedMatrix_t* dev, const int16_t x, const int16_t y, const bool state)
{
    const uint16_t totalWidth = dev->matrixCount * 8;
    if (x < 0 || x >= totalWidth || y < 0 || y >= 8) return;

    // Xử lý xoay tọa độ
    int16_t physX = x;
    int16_t physY = y;
    if (dev->rotation == MATRIX_ROTATE_90)
    {
        physX = y;
        physY = totalWidth - 1 - x;
    }
    else if (dev->rotation == MATRIX_ROTATE_180)
    {
        physX = totalWidth - 1 - x;
        physY = 7 - y;
    }
    else if (dev->rotation == MATRIX_ROTATE_270)
    {
        physX = 7 - y;
        physY = x;
    }

    const uint8_t devIdx = physX / 8;
    const uint8_t localX = physX % 8;
    const uint16_t bufferIndex = (devIdx * 8) + physY;

    if (state)
    {
        dev->frameBuffer[bufferIndex] |= (1 << (7 - localX));
    }
    else
    {
        dev->frameBuffer[bufferIndex] &= ~(1 << (7 - localX));
    }
}

void ledMatrixDrawLine(LedMatrix_t* dev, int16_t x0, int16_t y0, const int16_t x1, const int16_t y1, const bool state)
{
    const int16_t dx = (x1 > x0) ? (x1 - x0) : (x0 - x1);
    const int16_t sx = (x0 < x1) ? 1 : -1;
    const int16_t dy = (y1 > y0) ? (y0 - y1) : (y1 - y0);
    const int16_t sy = (y0 < y1) ? 1 : -1;
    int16_t err = dx + dy;

    while (1)
    {
        ledMatrixDrawPixel(dev, x0, y0, state);
        if (x0 == x1 && y0 == y1) break;
        int16_t e2 = 2 * err;
        if (e2 >= dy)
        {
            err += dy;
            x0 += sx;
        }
        if (e2 <= dx)
        {
            err += dx;
            y0 += sy;
        }
    }
}

void ledMatrixDrawChar(LedMatrix_t* dev, const int16_t x, const int16_t y, const char ch, const bool state)
{
    if (ch < 32 || ch > 126) return; // Chỉ xử lý ASCII hiển thị được
    const uint8_t fontIdx = ch - 32;

    for (uint8_t col = 0; col < 5; col++)
    {
        const uint8_t colBits = font5x7[fontIdx][col];
        for (uint8_t row = 0; row < 7; row++)
        {
            if (colBits & (1 << row))
            {
                ledMatrixDrawPixel(dev, x + col, y + row, state);
            }
        }
    }
}

void ledMatrixDrawString(LedMatrix_t* dev, int16_t x, const int16_t y, const char* str, const bool state)
{
    while (*str)
    {
        ledMatrixDrawChar(dev, x, y, *str, state);
        x += 6; // Đội rộng font 5px + 1px khoảng cách
        str++;
    }
}

void ledMatrixScrollTextAnimation(LedMatrix_t* dev, const char* str, const int16_t y, const bool state)
{
    static int16_t currentX = 0;
    static const char* lastStr = NULL;
    const uint16_t totalWidth = dev->matrixCount * 8;
    const int16_t strWidth = strlen(str) * 6;

    // Reset vị trí nếu chuỗi ký tự thay đổi
    if (str != lastStr)
    {
        lastStr = str;
        // Reset vị trí cuộn
        currentX = (dev->scrollDirection == MATRIX_SCROLL_LEFT) ? totalWidth : -strWidth;
    }

    // Xóa bộ đệm và vẽ chuỗi tại vị trí hiện tại
    ledMatrixClearBuffer(dev);
    ledMatrixDrawString(dev, currentX, y, str, state);

    // Thay đổi tọa độ dựa vào hướng chạy cấu hình trong Struct
    if (dev->scrollDirection == MATRIX_SCROLL_LEFT)
    {
        currentX--;
        if (currentX < -strWidth)
        {
            currentX = totalWidth;
        }
    }
    else if (dev->scrollDirection == MATRIX_SCROLL_RIGHT)
    {
        currentX++;
        if (currentX > totalWidth)
        {
            currentX = -strWidth;
        }
    }
}


void ledMatrixSetBrightness(LedMatrix_t* dev, const uint8_t brightness)
{
    max7219SetIntensity(&dev->maxDev, brightness);
}
